In [99]:
from sqlalchemy import create_engine
import pandas as pd
import pyarrow as pa
import numpy as np
from time import time

In [45]:
df_full.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge,airport_fee
0,1,2021-01-01 00:30:10,2021-01-01 00:36:12,1.0,2.10,1.0,N,142,43,2,8.0,3.0,0.5,0.00,0.0,0.3,11.80,2.5,NaN
1,1,2021-01-01 00:51:20,2021-01-01 00:52:19,1.0,0.20,1.0,N,238,151,2,3.0,0.5,0.5,0.00,0.0,0.3,4.30,0.0,NaN
2,1,2021-01-01 00:43:30,2021-01-01 01:11:06,1.0,14.70,1.0,N,132,165,1,42.0,0.5,0.5,8.65,0.0,0.3,51.95,0.0,NaN
3,1,2021-01-01 00:15:48,2021-01-01 00:31:01,0.0,10.60,1.0,N,138,132,1,29.0,0.5,0.5,6.05,0.0,0.3,36.35,0.0,NaN
4,2,2021-01-01 00:31:49,2021-01-01 00:48:21,1.0,4.94,1.0,N,68,33,1,16.5,0.5,0.5,4.06,0.0,0.3,24.36,2.5,NaN

In [46]:
print(pd.io.sql.get_schema(df_full,name="yellow_taxi",con=engine))

CREATE TABLE yellow_taxi (
	"VendorID" BIGINT,
	tpep_pickup_datetime TIMESTAMP WITHOUT TIME ZONE,
	tpep_dropoff_datetime TIMESTAMP WITHOUT TIME ZONE,
	passenger_count FLOAT(53),
	trip_distance FLOAT(53),
	"RatecodeID" FLOAT(53),
	store_and_fwd_flag TEXT,
	"PULocationID" BIGINT,
	"DOLocationID" BIGINT,
	payment_type BIGINT,
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	congestion_surcharge FLOAT(53),
	airport_fee FLOAT(53)
)

In [48]:
df_full["tpep_pickup_datetime"]=pd.to_datetime(df_full.tpep_pickup_datetime)
df_full["tpep_dropoff_datetime"]=pd.to_datetime(df_full.tpep_dropoff_datetime)

In [49]:
df_full.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1369769 entries, 0 to 1369768
Data columns (total 19 columns):
 #   Column                 Non-Null Count    Dtype
---  ------                 --------------    -----
 0   VendorID               1369769 non-null  int64
 1   tpep_pickup_datetime   1369769 non-null  datetime64[ns]
 2   tpep_dropoff_datetime  1369769 non-null  datetime64[ns]
 3   passenger_count        1271417 non-null  float64
 4   trip_distance          1369769 non-null  float64
 5   RatecodeID             1271417 non-null  float64
 6   store_and_fwd_flag     1271417 non-null  object
 7   PULocationID           1369769 non-null  int64
 8   DOLocationID           1369769 non-null  int64
 9   payment_type           1369769 non-null  int64
 10  fare_amount            1369769 non-null  float64
 11  extra                  1369769 non-null  float64
 12  mta_tax                1369769 non-null  float64
 13  tip_amount             1369769 non-null  float64
 14  tolls_amount           1369769 non-null  float64
 15  improvement_surcharge  1369769 non-null  float64
 16  total_amount           1369769 non-null  float64
 17  congestion_surcharge   1271417 non-null  float64
 18  airport_fee            5 non-null        float64
dtypes: datetime64[ns](2), float64(12), int64(4), object(1)
memory usage: 198.6+ MB

In [105]:
engine = create_engine('postgresql://rahul:root@localhost:5432/ny_taxi')

In [106]:
engine.connect()

In [87]:
df_full = pd.read_parquet("C:/data_engineering/docker_sql/yellow_tripdata_2021-01.parquet")

In [89]:
n = 100000  #chunk row size
list_df = [df_full[i:i+n] for i in range(0,df_full.shape[0],n)]

In [88]:
query="""
SELECT 1 as number;
"""

pd.read_sql(query,con=engine)

   number
0       1

In [90]:
for i in list_df:
    t_start=time()
    i.to_sql(name="yellow_taxi",con=engine,if_exists="append")
    t_end=time()
    print('inserted another chunk, took %.3f seconds'%(t_end-t_start))

inserted another chunk, took 11.427 seconds
inserted another chunk, took 10.772 seconds
inserted another chunk, took 9.899 seconds
inserted another chunk, took 12.151 seconds
inserted another chunk, took 11.235 seconds
inserted another chunk, took 11.061 seconds
inserted another chunk, took 10.731 seconds
inserted another chunk, took 11.666 seconds
inserted another chunk, took 10.913 seconds
inserted another chunk, took 10.355 seconds
inserted another chunk, took 11.817 seconds
inserted another chunk, took 12.109 seconds
inserted another chunk, took 9.986 seconds
inserted another chunk, took 7.251 seconds

In [100]:
df=pd.read_csv("C:/data_engineering/docker_sql/taxi_zone_lookup.csv")

In [101]:
df.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [107]:
df.head(n=0).to_sql(name="zone",con=engine,if_exists="replace")

0

In [108]:
df.to_sql(name="zone",con=engine,if_exists="append")

265